In [1]:
%load_ext sql

In [2]:
%sql sqlite:///vbo.db

# Manuel Tablo Oluşturma İşlemleri

In [3]:
%%sql
CREATE TABLE yeni_tablo(firstname varchar(20),
                       lastname varchar(20));

 * sqlite:///vbo.db
(sqlite3.OperationalError) table yeni_tablo already exists
[SQL: CREATE TABLE yeni_tablo(firstname varchar(20),
                       lastname varchar(20));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [4]:
%%sql 
INSERT INTO yeni_tablo values('Ali', 'Uzaya_Git');

 * sqlite:///vbo.db
1 rows affected.

[]

In [5]:
%%sql
SELECT * FROM yeni_tablo;

 * sqlite:///vbo.db
Done.

[('Ali', 'Uzaya_Git'), ('Işık', 'Süte_Devam'), ('Ali', 'Uzaya_Git')]

In [6]:
%%sql 
INSERT INTO yeni_tablo values('Işık', 'Süte_Devam');

 * sqlite:///vbo.db
1 rows affected.

[]

In [7]:
%%sql
SELECT * FROM yeni_tablo;

 * sqlite:///vbo.db
Done.

[('Ali', 'Uzaya_Git'),
 ('Işık', 'Süte_Devam'),
 ('Ali', 'Uzaya_Git'),
 ('Işık', 'Süte_Devam')]